<a href="https://colab.research.google.com/github/Karalius/Calculator/blob/master/Untitled5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import pandas as pd

In [2]:
import psycopg2

# Connect to heroku, P.S. Hide this in local!
sql_connection = psycopg2.connect(
    database="dfvnovppbbq4rl",
    user="yntjjrygcmheyc",
    password="477cb32bc389caa14bd09da3c5c4a5ee704213bce0033af8db470ea5fbd2f5de",
    host="ec2-34-254-69-72.eu-west-1.compute.amazonaws.com",
    port="5432"
)

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

In [3]:
cur = sql_connection.cursor()

cur.execute('''
CREATE TABLE IF NOT EXISTS categories (
    id serial PRIMARY KEY,
    category varchar(250)
);

CREATE TABLE IF NOT EXISTS items (
    id serial PRIMARY KEY,
    category_id int,
    title varchar(250),
    price int,
    item_url varchar(500),
    img_url varchar(500),
    FOREIGN KEY (category_id) REFERENCES categories(id)
);

''')

sql_connection.commit()

In [4]:
# Create dataframe

In [2]:
dict_data = {'category' : ['namai', 'namai', 'namai', 'butai', 'butai', 'sklypai'],
             'title': ['nam','nam','nam','but','but', 'sklyp'],
             'price': [100, 120, 140, 200, 220, 300],
             'item_url': ['url1','url2','url3','url4','url5','url6'],
             'img_url': ['img1','img2','img3', 'img4', 'img5', 'img6']
             }

In [5]:
df = pd.DataFrame(dict_data)

In [38]:
df

  category  title  price item_url img_url
0    namai    nam    100     url1    img1
1    namai    nam    120     url2    img2
2    namai    nam    140     url3    img3
3    butai    but    200     url4    img4
4    butai    but    220     url5    img5
5  sklypai  sklyp    300     url6    img6

In [8]:
cur = sql_connection.cursor()
for i in df['category'].unique():
    cur.execute(f"INSERT INTO categories (category) VALUES ('{i}');")
sql_connection.commit()

In [9]:
cur.execute("SELECT * FROM categories;")
for row in cur.fetchall():
    print(row)

(1, 'namai')
(2, 'butai')
(3, 'sklypai')

In [6]:
import numpy as np

In [7]:
foreign_key_df = pd.DataFrame(df['category'].unique(), columns=['category']).reset_index().rename(columns={'index': 'category_id'})
foreign_key_df['category_id'] = np.arange(1, len(foreign_key_df)+1)

In [8]:
items_df = pd.merge(
    df,
    foreign_key_df,
    on='category'
).drop(columns='category')

In [9]:
items_df.insert(0, 'category_id', items_df.pop('category_id'))

In [10]:
items_df

   category_id  title  price item_url img_url
0            1    nam    100     url1    img1
1            1    nam    120     url2    img2
2            1    nam    140     url3    img3
3            2    but    200     url4    img4
4            2    but    220     url5    img5
5            3  sklyp    300     url6    img6